// 4. Палиндром. Сравнить с развернутой строкой не используя reverse. For
// 5. Создать массив гласных из динамичного массива. Filter
// 6. Посчитать количество согласных в строке. В задаче необходимо хоть как-то
// затронуть forEach
// 7. Найти значение массива, повторяющееся в нем наибольшее количество раз
// 8. На вход программе подается строка текста содержащая «@». Разбить на массив.
// Напишите программу, которая удаляет все вхождения символа «@». Как вы
// думаете, что здесь применить: map, forEach, filter?
// 123@1@@34 -> 123134