// *На входе статичный массив [1, 2, 3, 4, 5, 6] и динамическое значение n. Необходимо
// разбить данный одномерный массив на маленькие массивы в зависимости от
// того, какого число ввел пользователь. Добавить проверки на ввод числа
// (значение n не должно быть больше длины массива, 0, пустая строка, строковый
// тип данных). Использовать любой цикл / метод перебора массива
// 1 -> [[1], [2], [3], [4], [5], [6]]
// 2 -> [[1, 2], [3, 4], [5, 6]]
// 3 -> [[1, 2, 3], [4, 5, 6]]
// 4 -> [[1, 2, 3, 4], [5, 6]
// 5 -> [[1, 2, 3, 4, 5], [6]]
// 6 -> [[1, 2, 3, 4, 5, 6]]

let arr = [1, 2, 3, 4, 5, 6];
const n = 2//prompt('количество элементов в новом массиве');
const result = []

// if (isNan(n) || n > arr.length || n === 0 || n === '' || String(n)) {
//     console.log('ошибка ввода');
// }
for (let i = 0; i < arr.length; i+=n) {
    let a = [];
    for (let j = 0; j < n; j++) {
        a.push(arr[j])
    }
    let narr = arr.splice(n)
    console.log(arr);

    result.push(a)

}

console.log(result);

// let arr = [1, 2, 3, 4, 5, 6];
// const n = 3//prompt('количество элементов в новом массиве');
// const result = []

// arr.forEach(function (elem) {
//     let a = [];
//     for (let elem = 0; elem < n; elem++) {
//         a.push(arr[elem])
//         let arr = arr.splice(n)
//     }
//     result.push(a)
// })
// console.log(result);